nxp-appcodehub/dm-lpc5536-evse-sigbrd/board/pin_mux.c
/*
 * Copyright 2021,2023-2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v9.0
processor: LPC55S36
package_id: LPC55S36JBD100
mcu_data: ksdk2_0
processor_version: 0.10.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iocon.h"
#include "pin_mux.h"
#include "fsl_gpio.h"
#include "sigbrd_application.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '93', peripheral: FLEXCOMM0, signal: RXD_SDA_MOSI_DATA, pin_signal: PIO0_29/FC0_RXD_SDA_MOSI_DATA/CTIMER2_MAT3/SCT0_OUT8/TRACEDATA2/FC6_RXD_SDA_MOSI_DATA/CMP0_OUT/SECURE_GPIO0_29/PWM0_A1/SPI_DIN/EXTTRIG_IN3,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '95', peripheral: FLEXCOMM0, signal: TXD_SCL_MISO_WS, pin_signal: PIO0_30/FC0_TXD_SCL_MISO_WS/CTIMER0_MAT0/SCT0_OUT9/TRACEDATA1/CAN0_TD/FC6_TXD_SCL_MISO_WS/SECURE_GPIO0_30/PWM1_A1/AOI1_OUT0,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '37', peripheral: PWM1, signal: 'A, 0', pin_signal: PIO1_21/FC7_CTS_SDA_SSEL0/CTIMER3_MAT2/FC4_RXD_SDA_MOSI_DATA/PWM1_A0/TRIGOUT_1, mode: inactive,
    slew_rate: standard, invert: disabled, open_drain: disabled}
  - {pin_num: '49', peripheral: PWM1, signal: 'A, 1', pin_signal: PIO1_23/FC2_SCK/SCT0_OUT0/FC3_SSEL2/PWM1_A1/TRIGOUT_4/HSCMP2_IN1, mode: inactive, slew_rate: standard,
    invert: disabled, open_drain: disabled, asw0: disabled}
  - {pin_num: '77', peripheral: PWM1, signal: 'A, 2', pin_signal: PIO1_25/FC2_TXD_SCL_MISO_WS/SCT0_OUT2/UTICK_CAP0/PWM1_A2/SPI_SCLK/AOI0_OUT3, mode: inactive, slew_rate: standard,
    invert: disabled, open_drain: disabled}
  - {pin_num: '84', peripheral: PWM1, signal: 'B, 0', pin_signal: PIO0_3/FC3_RXD_SDA_MOSI_DATA/CTIMER0_MAT1/SCT0_OUT1/SCT_GPI3/FLEXSPI0_DATA2/SECURE_GPIO0_3/PWM1_B0,
    mode: inactive, slew_rate: standard, invert: disabled, open_drain: disabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    CLOCK_EnableClock(kCLOCK_FlexComm7);

    /* P0_16 as CLKOUT for External AFE */
	IOCON->PIO[0][16] = ((IOCON->PIO[0][16] &
						  /* Mask bits to zero which are setting */
						  (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

						 /* Signal(function) select: PORT016 (pin 20) is configured as CLKOUT. */
						 | IOCON_PIO_FUNC(0x02u)

						 /* Select Digital mode: Enable Digital mode.
						  * Digital input is enabled. */
						 | IOCON_PIO_DIGIMODE(1U));

    if(g_sigboardHWVer == EVSE_SIGBRD_1X)
    {
    	const uint32_t port0_pin10_config = (/* Pin is configured as ADC0_1A */
    			IOCON_PIO_FUNC0 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables analog function */
				IOCON_PIO_ANALOG_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch 0 is closed (enabled) */
				IOCON_PIO_ASW0_EN);
    	/* PORT0 PIN10 (coords: 25) is configured as ADC0_1A */
    	IOCON_PinMuxSet(IOCON, 0U, 10U, port0_pin10_config);
    }

    else if(g_sigboardHWVer == EVSE_SIGBRD_2X)
    {
    	const uint32_t port0_pin15_config = (/* Pin is configured as ADC0_1A */
    			IOCON_PIO_FUNC0 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables analog function */
				IOCON_PIO_ANALOG_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch 0 is closed (enabled) */
				IOCON_PIO_ASW0_EN);
    	/* PORT0 PIN15 (coords: 25) is configured as ADC0_3A */
    	IOCON_PinMuxSet(IOCON, 0U, 15U, port0_pin15_config);


        const uint32_t port0_pin11_config = (/* Pin is configured as ADC1_2A */
                                             IOCON_PIO_FUNC0 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables analog function */
                                             IOCON_PIO_ANALOG_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN11 (coords: 9) is configured as ADC1_2A */
        IOCON_PinMuxSet(IOCON, 0U, 11U, port0_pin11_config);


        const uint32_t port0_pin12_config = (/* Pin is configured as ADC1_3A */
                                             IOCON_PIO_FUNC0 |
                                             /* No addition pin function */
                                             IOCON_PIO_MODE_INACT |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables analog function */
                                             IOCON_PIO_ANALOG_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN12 (coords: 10) is configured as ADC1_3A */
        IOCON_PinMuxSet(IOCON, 0U, 12U, port0_pin12_config);


