nxp-appcodehub/dm-lpc5536-evse-sigbrd/board/pin_mux.c
    }

    const uint32_t port1_pin19_config = (/* Pin is configured as ADC0_4B */
        		IOCON_PIO_FUNC0 |
    			/* No addition pin function */
    			IOCON_PIO_MODE_INACT |
    			/* Standard mode, output slew rate control is enabled */
    			IOCON_PIO_SLEW_STANDARD |
    			/* Input function is not inverted */
    			IOCON_PIO_INV_DI |
    			/* Enables analog function */
    			IOCON_PIO_ANALOG_EN |
    			/* Open drain is disabled */
    			IOCON_PIO_OPENDRAIN_DI |
    			/* Analog switch 0 is closed (enabled) */
    			IOCON_PIO_ASW0_EN);
        /* PORT1 PIN19 (coords: 30) is configured as ADC0_4B */
    IOCON_PinMuxSet(IOCON, 1U, 19U, port1_pin19_config);

    const uint32_t port1_pin21_config_pwm = (/* Pin is configured as PWM1_A0 */
    		IOCON_PIO_FUNC11 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
    /* PORT1 PIN21 (coords: 37) is configured as PWM1_A0 */
    IOCON_PinMuxSet(IOCON, 1U, 21U, port1_pin21_config_pwm);

    const uint32_t gpio_ip_config = (/* Pin is configured as PIO1_30 */
    		IOCON_PIO_FUNC0 |
			/* Selects pull-up function */
			IOCON_PIO_MODE_PULLUP |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI |
			/* Analog switch 0 is open (disabled) */
			IOCON_PIO_ASW0_DI);
    /* GFCI_INT: PORT1 PIN30 (coords: 65) is configured as PIO1_30 */
    IOCON_PinMuxSet(IOCON, 1U, 30U, gpio_ip_config);
    gpio_pin_config_t GFCI_config = {
    		.pinDirection = kGPIO_DigitalInput,
			.outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_30 (pin 65)  */
    GPIO_PinInit(GPIO, 1U, 30U, &GFCI_config);

    const uint32_t port0_pin1_config = (/* Pin is configured as CTIMER_INP0 */
    		IOCON_PIO_FUNC3 |
			/* No addition pin function */
			IOCON_PIO_MODE_INACT |
			/* Standard mode, output slew rate control is enabled */
			IOCON_PIO_SLEW_STANDARD |
			/* Input function is not inverted */
			IOCON_PIO_INV_DI |
			/* Enables digital function */
			IOCON_PIO_DIGITAL_EN |
			/* Open drain is disabled */
			IOCON_PIO_OPENDRAIN_DI);
    /* PORT0 PIN1 is configured as CTIMER_INP3 */
    IOCON_PinMuxSet(IOCON, 0U, 1U, port0_pin1_config);

#if 0
        gpio_pin_config_t HPGP_RESET_config = {
        		.pinDirection = kGPIO_DigitalOutput,
				.outputLogic = 1U
        };
        /* Initialize GPIO functionality on pin PIO0_13 (pin 70)  */
        GPIO_PinInit(GPIO, 0U, 13U, &HPGP_RESET_config);

        const uint32_t HPGP_RESET = (/* Pin is configured as PIO0_13 */
        		IOCON_PIO_FUNC0 |
				/* Selects pull-up function */
				//OCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN13 (coords: 70) is configured as PIO0_13 */
        //IOCON_PinMuxSet(IOCON, 0U, 13U, HPGP_RESET);
#endif
        gpio_pin_config_t LED_config = {
        		.pinDirection = kGPIO_DigitalOutput,
				.outputLogic = 1U
        };
        /* Initialize GPIO functionality on pin PIO0_20 (pin 73)  */
        GPIO_PinInit(GPIO, 0U, 20U, &LED_config);
        /* Initialize GPIO functionality on pin PIO1_4 (pin 75)  */
        GPIO_PinInit(GPIO, 1U, 4U, &LED_config);

        const uint32_t LED = (/* Pin is configured as PIO0_20 */
        		IOCON_PIO_FUNC0 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN22 (coords: 73) is configured as PIO0_20 */
        IOCON_PinMuxSet(IOCON, 0U, 20U, LED);
        /* PORT1 PIN4 (coords: 75) is configured as PIO1_4 */
        IOCON_PinMuxSet(IOCON, 1U, 4U, LED);


        /* PORT1 PIN9 (coords: 25) is configured as IOCON_PIO_FUNC0 */
        const uint32_t port1_pin9_config = (/* Pin is configured as OPAMP0_OUT */
                                            IOCON_PIO_FUNC0 |
                                            /* No addition pin function */
                                            IOCON_PIO_MODE_INACT |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables analog function */
                                            IOCON_PIO_ANALOG_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI |
                                            /* Analog switch 0 is closed (enabled) */
                                            IOCON_PIO_ASW0_EN);
        /* PORT1 PIN9 (coords: 25) is configured as OPAMP0_OUT */
        IOCON_PinMuxSet(IOCON, 1U, 9U, port1_pin9_config);

        const uint32_t port0_pin28_config = (/* Pin is configured as PIO0_28 */
        		IOCON_PIO_FUNC0 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch 0 is open (disabled) */
				IOCON_PIO_ASW0_DI);
        /* GFCI_INT: PORT0 PIN28 (coords: 66) is configured as PIO0_28 */
        IOCON_PinMuxSet(IOCON, 0U, 28U, port0_pin28_config);
        gpio_pin_config_t WAKEUP_config = {
        		.pinDirection = kGPIO_DigitalInput,
				.outputLogic = 0U
        };
        /* Initialize GPIO functionality on pin PIO0_28 (pin 66)  */
        GPIO_PinInit(GPIO, 0U, 28U, &WAKEUP_config);

        const uint32_t RELAY = (/* Pin is configured as PIO1_24 */
        		IOCON_PIO_FUNC0 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);

        gpio_pin_config_t RELAY_ON_config = {
        		.pinDirection = kGPIO_DigitalOutput,
				.outputLogic = 1U
        };

        if(g_sigboardHWVer == EVSE_SIGBRD_1X)
        {

            /* PORT0 PIN22 (coords: 73) is configured as PIO0_20 */
            IOCON_PinMuxSet(IOCON, 1U, 28U, RELAY);

            /* Initialize GPIO functionality on pin PIO1_28 (pin 72)  */
            GPIO_PinInit(GPIO, 1U, 28U, &RELAY_ON_config);

