nxp-appcodehub/dm-lpc5536-evse-sigbrd/board/pin_mux.c
        }

        else if(g_sigboardHWVer == EVSE_SIGBRD_2X)
        {
            /* PORT0 PIN22 (coords: 73) is configured as PIO0_20 */
            IOCON_PinMuxSet(IOCON, 1U, 29U, RELAY);

            /* Initialize GPIO functionality on pin PIO1_29 (pin 80)  */
            GPIO_PinInit(GPIO, 1U, 29U, &RELAY_ON_config);

        }

        /* PORT1 PIN4 (coords: 75) is configured as PIO1_4 */
        IOCON_PinMuxSet(IOCON, 0U, 24U, RELAY);

        gpio_pin_config_t RELAY_OFF_config = {
        		.pinDirection = kGPIO_DigitalOutput,
				.outputLogic = 0U
        };

        /* Initialize GPIO functionality on pin PIO0_24 (pin 69)  */
        GPIO_PinInit(GPIO, 0U, 24U, &RELAY_OFF_config);

        IOCON_PinMuxSet(IOCON, 0U, 14U, gpio_ip_config);
        gpio_pin_config_t EM_STOP_config = {
        		.pinDirection = kGPIO_DigitalInput,
				.outputLogic = 0U
        };
       /* Initialize GPIO functionality on pin PIO0_14 (pin 71)  */
        GPIO_PinInit(GPIO, 0U, 14U, &EM_STOP_config);

        const uint32_t port0_pin29_config = (/* Pin is configured as FC0_RXD_SDA_MOSI_DATA */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN29 (coords: 93) is configured as FC0_RXD_SDA_MOSI_DATA */
        IOCON_PinMuxSet(IOCON, 0U, 29U, port0_pin29_config);

#if 0
        const uint32_t port0_pin30_config = (/* Pin is configured as FC0_TXD_SCL_MISO_WS */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN30 (coords: 95) is configured as FC0_TXD_SCL_MISO_WS */
        IOCON_PinMuxSet(IOCON, 0U, 30U, port0_pin30_config);
#endif

        /* LIN */
        const uint32_t port0_pin2_config = (/* Pin is configured as FC3_TXD_SCL_MISO_WS */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN2 (coords: 81) is configured as FC3_TXD_SCL_MISO_WS */
        IOCON_PinMuxSet(IOCON, 0U, 2U, port0_pin2_config);

        const uint32_t port0_pin3_config = (/* Pin is configured as FC3_RXD_SDA_MOSI_DATA */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN3 (coords: 84) is configured as FC3_RXD_SDA_MOSI_DATA */
        IOCON_PinMuxSet(IOCON, 0U, 3U, port0_pin3_config);

        /* M_UART */
        const uint32_t port1_pin10_config = (/* Pin is configured as FC1_RXD */
        		IOCON_PIO_FUNC2 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN10 (coords: 39) is configured as FC1_RXD */
        IOCON_PinMuxSet(IOCON, 1U, 10U, port1_pin10_config);

        const uint32_t port1_pin11_config = (/* Pin is configured as FC1_TXD */
        		IOCON_PIO_FUNC2 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN11 (coords: 94) is configured as FC1_TXD */
        IOCON_PinMuxSet(IOCON, 1U, 11U, port1_pin11_config);

        const uint32_t port1_pin23_config = (/* Pin is configured as FC2_SCK */
        		IOCON_PIO_FUNC1 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch 0 is open (disabled) */
				IOCON_PIO_ASW0_DI);
        /* PORT1 PIN23 (coords: 49) is configured as FC2_SCK */
        IOCON_PinMuxSet(IOCON, 1U, 23U, port1_pin23_config);

        const uint32_t port1_pin24_config = (/* Pin is configured as FC2_RXD_SDA_MOSI_DATA */
        		IOCON_PIO_FUNC1 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI |
				/* Analog switch 0 is open (disabled) */
				IOCON_PIO_ASW0_DI);
        /* PORT1 PIN24 (coords: 3) is configured as FC2_RXD_SDA_MOSI_DATA */
        IOCON_PinMuxSet(IOCON, 1U, 24U, port1_pin24_config);

        const uint32_t port1_pin25_config = (/* Pin is configured as FC2_TXD_SCL_MISO_WS */
        		IOCON_PIO_FUNC1 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN25 (coords: 77) is configured as FC2_TXD_SCL_MISO_WS */
        IOCON_PinMuxSet(IOCON, 1U, 25U, port1_pin25_config);

        const uint32_t port1_pin26_config = (/* Pin is configured as FC2_CTS_SDA_SSEL0 */
        		IOCON_PIO_FUNC1 |
				/* Selects pull-up function */
				IOCON_PIO_MODE_PULLUP |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN26 (coords: 68) is configured as FC2_CTS_SDA_SSEL0 */
        IOCON_PinMuxSet(IOCON, 1U, 26U, port1_pin26_config);

