nxp-appcodehub/dm-lpc5536-evse-sigbrd/board/pin_mux.c
        const uint32_t port0_pin30_config = (/* Pin is configured as FC0_TXD_SCL_MISO_WS */
        		IOCON_PIO_FUNC1 |
				/* No addition pin function */
				IOCON_PIO_MODE_INACT |
				/* Standard mode, output slew rate control is enabled */
				IOCON_PIO_SLEW_STANDARD |
				/* Input function is not inverted */
				IOCON_PIO_INV_DI |
				/* Enables digital function */
				IOCON_PIO_DIGITAL_EN |
				/* Open drain is disabled */
				IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN30 (coords: 95) is configured as FC0_TXD_SCL_MISO_WS */
        IOCON_PinMuxSet(IOCON, 0U, 30U, port0_pin30_config);

        /*
         * AFE BLOCK PINS: P1_28 AFE_SPI_CLK , P0_6  AFE_SPI_MOSI, P0_4 AFE_SPI_MISO,
         * P1_20 AFE_SPI_SSEL1, P0_19 AFE_SPI_DATA_READY
         */

        const uint32_t port1_pin28_config = (/* Pin is configured as FC7_SCK */
                                             IOCON_PIO_FUNC1 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI |
                                             /* Analog switch 0 is open (disabled) */
                                             IOCON_PIO_ASW0_DI);
        /* PORT1 PIN28 (coords: 72) is configured as FC7_SCK */
        IOCON_PinMuxSet(IOCON, 1U, 28U, port1_pin28_config);


        const uint32_t port0_pin6_config = (/* Pin is configured as FC7_RXD_SDA_MOSI_DATA */
                                             IOCON_PIO_FUNC9 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI |
                                             /* Analog switch 0 is open (disabled) */
                                             IOCON_PIO_ASW0_DI);
        /* PORT0 PIN6 (coords: 89) is configured as FC7_RXD_SDA_MOSI_DATA */
        IOCON_PinMuxSet(IOCON, 0U, 6U, port0_pin6_config);

        const uint32_t port0_pin4_config = (/* Pin is configured as FC7_TXD_SCL_MISO_WS */
                                             IOCON_PIO_FUNC9 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN4 (coords: 87) is configured as FC7_TXD_SCL_MISO_WS */
        IOCON_PinMuxSet(IOCON, 0U, 4U, port0_pin4_config);


        const uint32_t port1_pin20_config = (/* Pin is configured as FC7_RTS_SCL_SSEL1 */
                                             IOCON_PIO_FUNC1 |
                                             /* Selects pull-up function */
                                             IOCON_PIO_MODE_PULLUP |
                                             /* Standard mode, output slew rate control is enabled */
                                             IOCON_PIO_SLEW_STANDARD |
                                             /* Input function is not inverted */
                                             IOCON_PIO_INV_DI |
                                             /* Enables digital function */
                                             IOCON_PIO_DIGITAL_EN |
                                             /* Open drain is disabled */
                                             IOCON_PIO_OPENDRAIN_DI);
        /* PORT1 PIN20 (coords: 11) is configured as FC7_RTS_SCL_SSEL1 */
        IOCON_PinMuxSet(IOCON, 1U, 20U, port1_pin20_config);

        const uint32_t port0_pin19_config = (/* Pin is configured as PIO0_19 */
                                             IOCON_PIO_FUNC0 |
											 /* Selects pull-up function */
											 IOCON_PIO_MODE_PULLUP |
											 /* Standard mode, output slew rate control is enabled */
											 IOCON_PIO_SLEW_STANDARD |
											 /* Input function is not inverted */
											 IOCON_PIO_INV_DI |
											 /* Enables digital function */
											 IOCON_PIO_DIGITAL_EN |
											 /* Open drain is disabled */
											 IOCON_PIO_OPENDRAIN_DI);
        /* PORT0 PIN19 (coords: 83) is configured as PIO0_19 */
		IOCON_PinMuxSet(IOCON, 0U, 19U, port0_pin19_config);

}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_PinStatus
 * Description   : Configures pin routing and optionally pin electrical features for getting the hardware version
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
uint8_t BOARD_PinStatus(void)
{
	uint8_t boardVer=0;
	uint8_t pin1_value, pin2_value, pin3_value = 0;

    /* Enables the clock for the I/O controller.: Enable Clock. */
    CLOCK_EnableClock(kCLOCK_Iocon);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);


    const uint32_t gpio_ip_Config = (/* Pin is configured as PIO1_15,16,17 */
                                            IOCON_PIO_FUNC0 |
                                            /* No addition pin function */
											IOCON_PIO_MODE_PULLDOWN |
                                            /* Standard mode, output slew rate control is enabled */
                                            IOCON_PIO_SLEW_STANDARD |
                                            /* Input function is not inverted */
                                            IOCON_PIO_INV_DI |
                                            /* Enables digital function */
                                            IOCON_PIO_DIGITAL_EN |
                                            /* Open drain is disabled */
                                            IOCON_PIO_OPENDRAIN_DI);

    /* PORT1 PIN15, PIN16, PIN17 is configured as PULL_DOWN */
    IOCON_PinMuxSet(IOCON, 1U, 15U, gpio_ip_Config);
    IOCON_PinMuxSet(IOCON, 1U, 16U, gpio_ip_Config);
    IOCON_PinMuxSet(IOCON, 1U, 17U, gpio_ip_Config);

    gpio_pin_config_t BoardVer_config = {
    		.pinDirection = kGPIO_DigitalInput,
			.outputLogic = 0U
    };
    /* Initialize GPIO functionality */
    GPIO_PinInit(GPIO, 1U, 15U, &BoardVer_config);
    GPIO_PinInit(GPIO, 1U, 16U, &BoardVer_config);
    GPIO_PinInit(GPIO, 1U, 17U, &BoardVer_config);

    /*Read Pin Values*/
    pin1_value = (uint8_t) (GPIO_PinRead(GPIO, 1U, 15U));
    pin2_value = (uint8_t) (GPIO_PinRead(GPIO, 1U, 16U));
    pin3_value = (uint8_t) (GPIO_PinRead(GPIO, 1U, 17U));

    boardVer = (pin3_value << 2) | (pin2_value << 1) | pin1_value;

    return boardVer;

}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
